"================Словари========================"
# Словарь (dict) - изменяемый, интерируемый, неиндексируемый, неупорядоченный тип данных, в котором значения хранятся в парах (ключ : значение)
dict = {"a":"Hello", "b":2, "c":3}
print(dict_["a"]) # "Hello"
a = 5
b = 7
print(a)
print("lokals"())

# Ключами в словаре могут являться все неизменяемые типы данных 
# значениями в словаре могут являться любые типы данных
# Ключи должны быть уникальными
Dict_ = {
    1:"Hello",
    "a":4
    4.5:{"a":5},
    {"5":5}: 44  #TypeError: unhashable: 'dict'
}

print(dict_[4.5]) # {"a":5}
print(dict_[4.5]["a"]) # 5
print(dict_["a"]) # KeyError: "a"


"=========================Методы Словаря===================="
dict_.clear()  #Чистить
print(dict_) #{}

dict.fromkeys([1,2,4], 'Hello')
print(dict_) # {1:'Hello', 2:'Hello', 4:'Hello'}

dict_ = {"a":2, "a":3, "a":4}
print(dict_) # {"a":4}

dict_ = {"a":1, "b":2}
dict_["a"] #1
dict_["c"] #KeyError


# Метод get нужен для получения значений
dict_.get("a") #1
dict_.get("c") #None
dict_.get("c", 5) #5
dict_.get("a", 5) #1

dict_,keys() #dict_keys(['a'])
