"=================Логическое==============="
# логические операторы - выражение,True, если правда и False,если не правда

5 == 5 # True
4 == 5 # False

5 != 5 # False
5 != 2 # True

5 > 10 # False
10 > 5 # True
5 > 5 # False

5 < 10 # True
10 < 5 # False
5 < 5 # False

5 <= 10 # True
10 <= 5 # False
5 <= 5 # True

5 >= 10 # False
10 >= 5 # True
5 >= 5 # True

'5' == 5 #False


"=======================Boolean Tye=================" 
# Булевые тип данных - имеет всего 2 значения True и  False
bool(1) #True
bool(0) #False
bool(-277) #True

bool('hello') #True
bool('') #False
bool(' ') #True

bool(True) #False
bool(False) #False



"=====================None=================="
# None - это тип данных с одним None, который используется для оюозначения пустых значений или отсутствия значения
bool(None) #False
bool('None') #True


a = None
print(bool(a)) #False
print(a is None) #True

# is -Это проверка на полное соответствие



"====================Условные операторы======================="
# условные операторы нужны для того, чтобы при разных входных данных код работал по разному

Anastasiya Tuzikova, [10/6/22 11:43]
if условие1:
    тело1
    # будет работать только если условие1 верно

if условие1:
    тело1
    # будет работать только если условие1 верно
else:
    тело2
    # будет работать если условие1 не верно

if условие1:
    тело1
    # будет работать только если условие1 верно
elif условие2:
    тело2
    # будет работать если условие1 не верно и условие2 верно

if условие1:
    тело1
    # будет работать только если условие1 верно
elif условие2:
    тело2
    # будет работать если условие1 не верно и условие2 верно
else:
    тело3
    # будет работать если условие1 не верно и условие2 не верно

# в одной конструкции мы можем использовать только один if
# в одной конструкции мы можем использовать неограниченное кол-во elif или не указывать вообще
# else мы так-же можем использовать только один раз или не указывать вообще

# a =input('Ведите число: ')
# print(a)
# print(type(a))

# if a > 0:
#     print(f'число {a} -положительное')
# elif a < 0:
#     print(f'Число {a} -отрицательное')
# else (if) a == 0:
#     print(f'Число {a} -это 0')   
    #"можно заменить else"


"===================FizzBuzz===================="
# выведите числа от 1 до 100
# если число кратно 3 - вывести Fizz
# если число кратно 5 - вывести Buzz
# если число кратно и 5 и 3 - вывести FizzBuzz
# если число не кратно ни 5 ни 3 - вывести число

# for i in range(1, 101):
#     print(i)


for i in range(1, 101):
    if i % 3 ==0:
        print('Fizz')
    if i % 5 ==0:
        print('BUzz')
    if i % 3 ==0 or i%5 ==0:
        print('FizzBazz')
    else:
        print(i)


for i in range(1, 17):
    if i % 3 == 0 and i % 5 ==0:
        print("FizzBuzz")
    elif i % 3 == 0:
        print("Fizz")
    elif i % 5 == 0:
        print("Buzz")
    else:
        print(i)

for i in range(1, 17):
    if i % 3 == 0:
        if i % 5 == 0:
            print("FizzBuzz")
        else:
            print("Fizz")
    elif i % 5 == 0:
        print("Buzz")
    else:
        print(i)   
